set_device -family {RTG4} -die {RT4G150}
read_verilog -mode verilog_2k {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\User\GlueLogic\AXI_GLUE_LOGIC\1.0.7\vlog\AXI_glue_logic.v}
read_verilog -mode verilog_2k {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREBOOTSTRAP\2.0.100\rtl\vlog\core\corebootstrap_ahb_writer.v}
read_verilog -mode verilog_2k {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREBOOTSTRAP\2.0.100\rtl\vlog\core\corebootstrap_boot_reset.v}
read_verilog -mode verilog_2k {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREBOOTSTRAP\2.0.100\rtl\vlog\core\corebootstrap_cksum_ctrl.v}
read_verilog -mode verilog_2k {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREBOOTSTRAP\2.0.100\rtl\vlog\core\corebootstrap_spi_ctrl.v}
read_verilog -mode verilog_2k {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREBOOTSTRAP\2.0.100\rtl\vlog\core\corebootstrap_spi_reader.v}
read_verilog -mode verilog_2k {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREBOOTSTRAP\2.0.100\rtl\vlog\core\corebootstrap_spi_sel.v}
read_verilog -mode verilog_2k {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREBOOTSTRAP\2.0.100\rtl\vlog\core\corebootstrap.v}
read_verilog -mode verilog_2k {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CoreGPIO\3.1.101\rtl\vlog\core\coregpio.v}
read_verilog -mode verilog_2k {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\DDR_MEMORY_CTRL\COREABC_0\rtl\vlog\core\acmtable.v}
 add_include_path  {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\DDR_MEMORY_CTRL\COREABC_0\rtl\vlog\core}
read_verilog -mode verilog_2k {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\DDR_MEMORY_CTRL\COREABC_0\rtl\vlog\core\debugblk.v}
 add_include_path  {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\DDR_MEMORY_CTRL\COREABC_0\rtl\vlog\core}
read_verilog -mode verilog_2k {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\DDR_MEMORY_CTRL\COREABC_0\rtl\vlog\core\instructions.v}
 add_include_path  {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\DDR_MEMORY_CTRL\COREABC_0\rtl\vlog\core}
read_verilog -mode verilog_2k {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\DDR_MEMORY_CTRL\COREABC_0\rtl\vlog\core\instructnvm_bb.v}
read_verilog -mode verilog_2k {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\DDR_MEMORY_CTRL\COREABC_0\rtl\vlog\core\iram512x9_rtl.v}
read_verilog -mode verilog_2k {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\DDR_MEMORY_CTRL\COREABC_0\rtl\vlog\core\instructram.v}
read_verilog -mode verilog_2k {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\DDR_MEMORY_CTRL\COREABC_0\rtl\vlog\core\ram128x8_rtl.v}
read_verilog -mode verilog_2k {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\DDR_MEMORY_CTRL\COREABC_0\rtl\vlog\core\ram256x16_rtl.v}
read_verilog -mode verilog_2k {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\DDR_MEMORY_CTRL\COREABC_0\rtl\vlog\core\ram256x8_rtl.v}
read_verilog -mode verilog_2k {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\DDR_MEMORY_CTRL\COREABC_0\rtl\vlog\core\ramblocks.v}
 add_include_path  {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\DDR_MEMORY_CTRL\COREABC_0\rtl\vlog\core}
read_verilog -mode verilog_2k {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\DDR_MEMORY_CTRL\COREABC_0\rtl\vlog\core\coreabc.v}
read_verilog -mode verilog_2k {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\DDR_MEMORY_CTRL\FDDRC_0\DDR_MEMORY_CTRL_FDDRC_0_RTG4FDDRC.v}
read_verilog -mode verilog_2k -lib COREAPB3_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CoreAPB3\4.1.100\rtl\vlog\core\coreapb3_muxptob3.v}
read_verilog -mode verilog_2k -lib COREAPB3_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CoreAPB3\4.1.100\rtl\vlog\core\coreapb3_iaddr_reg.v}
read_verilog -mode verilog_2k -lib COREAPB3_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CoreAPB3\4.1.100\rtl\vlog\core\coreapb3.v}
read_verilog -mode verilog_2k {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\DDR_MEMORY_CTRL\DDR_MEMORY_CTRL.v}
read_verilog -mode verilog_2k {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CoreUARTapb_0\rtl\vlog\core\Clock_gen.v}
read_verilog -mode verilog_2k {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CoreUARTapb_0\rtl\vlog\core\Rx_async.v}
read_verilog -mode verilog_2k {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CoreUARTapb_0\rtl\vlog\core\Tx_async.v}
read_verilog -mode verilog_2k {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CoreUARTapb_0\rtl\vlog\core\fifo_256x8_rtg4.v}
read_verilog -mode verilog_2k {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CoreUARTapb_0\rtl\vlog\core\CoreUART.v}
read_verilog -mode verilog_2k {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CoreUARTapb_0\rtl\vlog\core\CoreUARTapb.v}
read_verilog -mode verilog_2k {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\RTG4FCCC_0\RTG4_CoreRISCV_AXI4_BaseDesign_RTG4FCCC_0_RTG4FCCC.v}
read_verilog -mode verilog_2k {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\hdl\reset_synchronizer.v}
read_verilog -mode verilog_2k -lib COREAHBLITE_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CoreAHBLite\5.2.100\rtl\vlog\core\coreahblite_addrdec.v}
read_verilog -mode verilog_2k -lib COREAHBLITE_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CoreAHBLite\5.2.100\rtl\vlog\core\coreahblite_defaultslavesm.v}
read_verilog -mode verilog_2k -lib COREAHBLITE_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CoreAHBLite\5.2.100\rtl\vlog\core\coreahblite_masterstage.v}
read_verilog -mode verilog_2k -lib COREAHBLITE_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CoreAHBLite\5.2.100\rtl\vlog\core\coreahblite_slavearbiter.v}
read_verilog -mode verilog_2k -lib COREAHBLITE_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CoreAHBLite\5.2.100\rtl\vlog\core\coreahblite_slavestage.v}
read_verilog -mode verilog_2k -lib COREAHBLITE_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CoreAHBLite\5.2.100\rtl\vlog\core\coreahblite_matrix4x16.v}
read_verilog -mode verilog_2k -lib COREAHBLITE_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CoreAHBLite\5.2.100\rtl\vlog\core\coreahblite.v}
read_verilog -mode verilog_2k -lib COREAHBTOAPB3_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREAHBTOAPB3\3.1.100\rtl\vlog\core\coreahbtoapb3_ahbtoapbsm.v}
read_verilog -mode verilog_2k -lib COREAHBTOAPB3_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREAHBTOAPB3\3.1.100\rtl\vlog\core\coreahbtoapb3_apbaddrdata.v}
read_verilog -mode verilog_2k -lib COREAHBTOAPB3_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREAHBTOAPB3\3.1.100\rtl\vlog\core\coreahbtoapb3_penablescheduler.v}
read_verilog -mode verilog_2k -lib COREAHBTOAPB3_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREAHBTOAPB3\3.1.100\rtl\vlog\core\coreahbtoapb3.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_AHBMasterCtrl.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_AXIOutReg.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_WSTRBAddrOffset.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_WSTRBPopCntr.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_readByteCnt.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_AXISlaveCtrl.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_RAM_syncWrAsyncRd.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_synchronizer.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL.v}
read_verilog -mode verilog_2k -lib COREJTAGDEBUG_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREJTAGDEBUG\2.0.100\rtl\vlog\core\corejtagdebug_uj_jtag.v}
read_verilog -mode verilog_2k -lib COREJTAGDEBUG_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREJTAGDEBUG\2.0.100\rtl\vlog\core\corejtagdebug.v}
 add_include_path  {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_async_fifo.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_debug_transport_module_jtag.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_client_uncached_tile_link_io_arbiter.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_arbiter.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_arbiter_1.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_arbiter_2.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_d_cache_data_array_rtg4.v}
 add_include_path  {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_finish_queue.v}
 add_include_path  {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_metadata_array.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_tlb.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_d_cache.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_flow_through_serializer.v}
 add_include_path  {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_i_cache.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_frontend.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_hella_cache_arbiter.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_alu.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_breakpoint_unit.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_csr_file.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_mul_div.v}
 add_include_path  {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_rocket.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_rocket_tile.v}
 add_include_path  {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_debug_module.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_level_gateway.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_id_mapper.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_locking_arbiter_1.v}
 add_include_path  {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_reorder_queue_3.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_nasti_io_tile_link_io_converter_1.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_client_tile_link_enqueuer.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_locking_rr_arbiter_5.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_reorder_queue.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_client_tile_link_io_unwrapper.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_manager_to_client_stateless_bridge.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_mmio_tile_link_manager.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_locking_arbiter.v}
 add_include_path  {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_reorder_queue_2.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_nasti_io_tile_link_io_converter.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_locking_rr_arbiter.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_basic_bus.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_locking_rr_arbiter_1.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_basic_bus_1.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_locking_rr_arbiter_2.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_basic_bus_2.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_locking_rr_arbiter_3.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_basic_bus_3.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_locking_rr_arbiter_4.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_basic_bus_4.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_client_tile_link_network_port.v}
 add_include_path  {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_finish_queue_1.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_finish_unit.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_client_uncached_tile_link_network_port.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_manager_tile_link_network_port.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_manager_tile_link_network_port_1.v}
 add_include_path  {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_queue.v}
 add_include_path  {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_queue_1.v}
 add_include_path  {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_queue_2.v}
 add_include_path  {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_queue_3.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_tile_link_enqueuer.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_tile_link_enqueuer_1.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_tile_link_enqueuer_2.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_ported_tile_link_crossbar.v}
 add_include_path  {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_queue_10.v}
 add_include_path  {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_queue_12.v}
 add_include_path  {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_queue_13.v}
 add_include_path  {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_queue_14.v}
 add_include_path  {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_queue_8.v}
 add_include_path  {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_queue_9.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_client_uncached_tile_link_io_arbiter_1.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_tile_link_memory_interconnect.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_outer_memory_system.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_plic.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_prci.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_rom_slave.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_locking_rr_arbiter_6.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_client_uncached_tile_link_io_router.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_client_uncached_tile_link_io_crossbar.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_locking_rr_arbiter_7.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_client_uncached_tile_link_io_router_1.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_client_uncached_tile_link_io_crossbar_1.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_tile_link_recursive_interconnect_1.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_tile_link_recursive_interconnect.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_uncore.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4_top.v}
read_verilog -mode verilog_2k -lib CORERISCV_AXI4_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CORERISCV_AXI4_0\rtl\vlog\core\coreriscv_axi4.v}
read_verilog -mode verilog_2k -lib CORESPI_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CORESPI\5.1.104\rtl\vlog\core\spi_clockmux.v}
read_verilog -mode verilog_2k -lib CORESPI_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CORESPI\5.1.104\rtl\vlog\core\spi_chanctrl.v}
read_verilog -mode verilog_2k -lib CORESPI_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CORESPI\5.1.104\rtl\vlog\core\spi_control.v}
read_verilog -mode verilog_2k -lib CORESPI_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CORESPI\5.1.104\rtl\vlog\core\spi_fifo.v}
read_verilog -mode verilog_2k -lib CORESPI_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CORESPI\5.1.104\rtl\vlog\core\spi_rf.v}
read_verilog -mode verilog_2k -lib CORESPI_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CORESPI\5.1.104\rtl\vlog\core\spi.v}
read_verilog -mode verilog_2k -lib CORESPI_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CORESPI\5.1.104\rtl\vlog\core\corespi.v}
read_verilog -mode verilog_2k -lib CORETIMER_LIB {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CoreTimer\2.0.103\rtl\vlog\core\coretimer.v}
read_verilog -mode verilog_2k {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\RTG4_CoreRISCV_AXI4_BaseDesign.v}
set_top_level {RTG4_CoreRISCV_AXI4_BaseDesign}
read_sdc -component {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\RTG4FCCC_0\RTG4_CoreRISCV_AXI4_BaseDesign_RTG4FCCC_0_RTG4FCCC.sdc}
derive_constraints
write_sdc {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\constraint\RTG4_CoreRISCV_AXI4_BaseDesign_derived_constraints.sdc}
write_pdc {C:\Users\cyril.jean\Documents\GitHub\Cyril-Jean\RTG4-Development-Kit\Libero\RTG4_CoreRISCV_AXI4_BaseDesign\constraint\fp\RTG4_CoreRISCV_AXI4_BaseDesign_derived_constraints.pdc}
