set_device -family {RTG4} -die {RT4G150}
read_verilog -mode verilog_2k -lib COREAHBLITE_LIB {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\Actel\DirectCore\CoreAHBLite\5.2.100\rtl\vlog\core\coreahblite.v}
read_verilog -mode verilog_2k -lib COREAHBLITE_LIB {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\Actel\DirectCore\CoreAHBLite\5.2.100\rtl\vlog\core\coreahblite_addrdec.v}
read_verilog -mode verilog_2k -lib COREAHBLITE_LIB {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\Actel\DirectCore\CoreAHBLite\5.2.100\rtl\vlog\core\coreahblite_defaultslavesm.v}
read_verilog -mode verilog_2k -lib COREAHBLITE_LIB {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\Actel\DirectCore\CoreAHBLite\5.2.100\rtl\vlog\core\coreahblite_masterstage.v}
read_verilog -mode verilog_2k -lib COREAHBLITE_LIB {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\Actel\DirectCore\CoreAHBLite\5.2.100\rtl\vlog\core\coreahblite_matrix4x16.v}
read_verilog -mode verilog_2k -lib COREAHBLITE_LIB {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\Actel\DirectCore\CoreAHBLite\5.2.100\rtl\vlog\core\coreahblite_slavearbiter.v}
read_verilog -mode verilog_2k -lib COREAHBLITE_LIB {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\Actel\DirectCore\CoreAHBLite\5.2.100\rtl\vlog\core\coreahblite_slavestage.v}
read_verilog -mode verilog_2k -lib COREAHBTOAPB3_LIB {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\Actel\DirectCore\COREAHBTOAPB3\3.1.100\rtl\vlog\core\coreahbtoapb3.v}
read_verilog -mode verilog_2k -lib COREAHBTOAPB3_LIB {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\Actel\DirectCore\COREAHBTOAPB3\3.1.100\rtl\vlog\core\coreahbtoapb3_ahbtoapbsm.v}
read_verilog -mode verilog_2k -lib COREAHBTOAPB3_LIB {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\Actel\DirectCore\COREAHBTOAPB3\3.1.100\rtl\vlog\core\coreahbtoapb3_apbaddrdata.v}
read_verilog -mode verilog_2k -lib COREAHBTOAPB3_LIB {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\Actel\DirectCore\COREAHBTOAPB3\3.1.100\rtl\vlog\core\coreahbtoapb3_penablescheduler.v}
read_verilog -mode verilog_2k -lib COREAPB3_LIB {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\Actel\DirectCore\CoreAPB3\4.1.100\rtl\vlog\core\coreapb3.v}
read_verilog -mode verilog_2k -lib COREAPB3_LIB {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\Actel\DirectCore\CoreAPB3\4.1.100\rtl\vlog\core\coreapb3_iaddr_reg.v}
read_verilog -mode verilog_2k -lib COREAPB3_LIB {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\Actel\DirectCore\CoreAPB3\4.1.100\rtl\vlog\core\coreapb3_muxptob3.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_AHBMasterCtrl.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_AXIOutReg.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_AXISlaveCtrl.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_RAM_syncWrAsyncRd.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_readByteCnt.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_synchronizer.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_WSTRBAddrOffset.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_WSTRBPopCntr.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\Actel\DirectCore\COREBOOTSTRAP\2.0.100\rtl\vlog\core\corebootstrap.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\Actel\DirectCore\COREBOOTSTRAP\2.0.100\rtl\vlog\core\corebootstrap_ahb_writer.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\Actel\DirectCore\COREBOOTSTRAP\2.0.100\rtl\vlog\core\corebootstrap_boot_reset.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\Actel\DirectCore\COREBOOTSTRAP\2.0.100\rtl\vlog\core\corebootstrap_cksum_ctrl.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\Actel\DirectCore\COREBOOTSTRAP\2.0.100\rtl\vlog\core\corebootstrap_spi_ctrl.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\Actel\DirectCore\COREBOOTSTRAP\2.0.100\rtl\vlog\core\corebootstrap_spi_reader.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\Actel\DirectCore\COREBOOTSTRAP\2.0.100\rtl\vlog\core\corebootstrap_spi_sel.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\Actel\DirectCore\CoreGPIO\3.1.101\rtl\vlog\core\coregpio.v}
read_verilog -mode verilog_2k -lib COREJTAGDEBUG_LIB {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\Actel\DirectCore\COREJTAGDEBUG\1.0.102\rtl\vlog\core\corejtagdebug.v}
read_verilog -mode verilog_2k -lib COREJTAGDEBUG_LIB {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\Actel\DirectCore\COREJTAGDEBUG\1.0.102\rtl\vlog\core\corejtagdebug_uj_jtag.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\Actel\DirectCore\CORERISCV_AXI4\1.0.100\rtl\verilog\AsyncFifo.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\Actel\DirectCore\CORERISCV_AXI4\1.0.100\rtl\verilog\CoreRISCV_AXI4.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\Actel\DirectCore\CORERISCV_AXI4\1.0.100\rtl\verilog\DebugTransportModuleJtag.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\Actel\DirectCore\CORERISCV_AXI4\1.0.100\rtl\verilog\Top.v}
read_verilog -mode verilog_2k -lib CORESPI_LIB {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\Actel\DirectCore\CORESPI\5.1.104\rtl\vlog\core\corespi.v}
read_verilog -mode verilog_2k -lib CORESPI_LIB {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\Actel\DirectCore\CORESPI\5.1.104\rtl\vlog\core\spi.v}
read_verilog -mode verilog_2k -lib CORESPI_LIB {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\Actel\DirectCore\CORESPI\5.1.104\rtl\vlog\core\spi_chanctrl.v}
read_verilog -mode verilog_2k -lib CORESPI_LIB {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\Actel\DirectCore\CORESPI\5.1.104\rtl\vlog\core\spi_clockmux.v}
read_verilog -mode verilog_2k -lib CORESPI_LIB {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\Actel\DirectCore\CORESPI\5.1.104\rtl\vlog\core\spi_control.v}
read_verilog -mode verilog_2k -lib CORESPI_LIB {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\Actel\DirectCore\CORESPI\5.1.104\rtl\vlog\core\spi_fifo.v}
read_verilog -mode verilog_2k -lib CORESPI_LIB {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\Actel\DirectCore\CORESPI\5.1.104\rtl\vlog\core\spi_rf.v}
read_verilog -mode verilog_2k -lib CORETIMER_LIB {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\Actel\DirectCore\CoreTimer\2.0.103\rtl\vlog\core\coretimer.v}
read_verilog -mode verilog_2k -lib AHBLITE_GLUE_LOGIC_LIB {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\User\GlueLogic\AHBLITE_GLUE_LOGIC\1.0.7\rtl\vlog\core\ahblite_glue_logic.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\User\GlueLogic\AXI_GLUE_LOGIC\1.0.7\vlog\AXI_glue_logic.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\DDR_EAST\COREABC_0\rtl\vlog\core\acmtable.v}
 add_include_path  {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\DDR_EAST\COREABC_0\rtl\vlog\core}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\DDR_EAST\COREABC_0\rtl\vlog\core\coreabc.v}
 add_include_path  {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\DDR_EAST\COREABC_0\rtl\vlog\core}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\DDR_EAST\COREABC_0\rtl\vlog\core\debugblk.v}
 add_include_path  {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\DDR_EAST\COREABC_0\rtl\vlog\core}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\DDR_EAST\COREABC_0\rtl\vlog\core\instructions.v}
 add_include_path  {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\DDR_EAST\COREABC_0\rtl\vlog\core}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\DDR_EAST\COREABC_0\rtl\vlog\core\instructnvm_bb.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\DDR_EAST\COREABC_0\rtl\vlog\core\instructram.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\DDR_EAST\COREABC_0\rtl\vlog\core\iram512x9_rtl.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\DDR_EAST\COREABC_0\rtl\vlog\core\ram128x8_rtl.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\DDR_EAST\COREABC_0\rtl\vlog\core\ram256x16_rtl.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\DDR_EAST\COREABC_0\rtl\vlog\core\ram256x8_rtl.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\DDR_EAST\COREABC_0\rtl\vlog\core\ramblocks.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\DDR_EAST\DDR_EAST.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\DDR_EAST\FDDRC_0\DDR_EAST_FDDRC_0_RTG4FDDRC.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\DDR_MEMORY_CTRL\COREABC_0\rtl\vlog\core\acmtable.v}
 add_include_path  {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\DDR_MEMORY_CTRL\COREABC_0\rtl\vlog\core}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\DDR_MEMORY_CTRL\COREABC_0\rtl\vlog\core\coreabc.v}
 add_include_path  {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\DDR_MEMORY_CTRL\COREABC_0\rtl\vlog\core}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\DDR_MEMORY_CTRL\COREABC_0\rtl\vlog\core\debugblk.v}
 add_include_path  {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\DDR_MEMORY_CTRL\COREABC_0\rtl\vlog\core}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\DDR_MEMORY_CTRL\COREABC_0\rtl\vlog\core\instructions.v}
 add_include_path  {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\DDR_MEMORY_CTRL\COREABC_0\rtl\vlog\core}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\DDR_MEMORY_CTRL\COREABC_0\rtl\vlog\core\instructnvm_bb.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\DDR_MEMORY_CTRL\COREABC_0\rtl\vlog\core\instructram.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\DDR_MEMORY_CTRL\COREABC_0\rtl\vlog\core\iram512x9_rtl.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\DDR_MEMORY_CTRL\COREABC_0\rtl\vlog\core\ram128x8_rtl.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\DDR_MEMORY_CTRL\COREABC_0\rtl\vlog\core\ram256x16_rtl.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\DDR_MEMORY_CTRL\COREABC_0\rtl\vlog\core\ram256x8_rtl.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\DDR_MEMORY_CTRL\COREABC_0\rtl\vlog\core\ramblocks.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\DDR_MEMORY_CTRL\DDR_MEMORY_CTRL.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\DDR_MEMORY_CTRL\FDDRC_0\DDR_MEMORY_CTRL_FDDRC_0_RTG4FDDRC.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CoreUARTapb_0\rtl\vlog\core\Clock_gen.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CoreUARTapb_0\rtl\vlog\core\CoreUART.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CoreUARTapb_0\rtl\vlog\core\CoreUARTapb.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CoreUARTapb_0\rtl\vlog\core\fifo_256x8_rtg4.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CoreUARTapb_0\rtl\vlog\core\Rx_async.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CoreUARTapb_0\rtl\vlog\core\Tx_async.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CoreUARTapb_1\rtl\vlog\core\Clock_gen.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CoreUARTapb_1\rtl\vlog\core\CoreUART.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CoreUARTapb_1\rtl\vlog\core\CoreUARTapb.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CoreUARTapb_1\rtl\vlog\core\fifo_256x8_rtg4.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CoreUARTapb_1\rtl\vlog\core\Rx_async.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\CoreUARTapb_1\rtl\vlog\core\Tx_async.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\RTG4FCCC_0\RTG4_CoreRISCV_AXI4_BaseDesign_RTG4FCCC_0_RTG4FCCC.v}
read_verilog -mode verilog_2k {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\RTG4_CoreRISCV_AXI4_BaseDesign.v}
set_top_level {RTG4_CoreRISCV_AXI4_BaseDesign}
read_sdc -component {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\component\work\RTG4_CoreRISCV_AXI4_BaseDesign\RTG4FCCC_0\RTG4_CoreRISCV_AXI4_BaseDesign_RTG4FCCC_0_RTG4FCCC.sdc}
derive_constraints
write_sdc {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\constraint\RTG4_CoreRISCV_AXI4_BaseDesign_derived_constraints.sdc}
write_pdc {C:\Users\ciaran.lappin\Documents\RTG4_RISCV\RTG4-Development-Kit-master\Libero\RTG4_Dual_CoreRISCV_BaseDesign\constraint\fp\RTG4_CoreRISCV_AXI4_BaseDesign_derived_constraints.pdc}
