set_device -family {RTG4} -die {RT4G150}
read_verilog -mode verilog_2k -lib COREAHBLITE_LIB {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CoreAHBLite\5.2.100\rtl\vlog\core\coreahblite.v}
read_verilog -mode verilog_2k -lib COREAHBLITE_LIB {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CoreAHBLite\5.2.100\rtl\vlog\core\coreahblite_addrdec.v}
read_verilog -mode verilog_2k -lib COREAHBLITE_LIB {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CoreAHBLite\5.2.100\rtl\vlog\core\coreahblite_defaultslavesm.v}
read_verilog -mode verilog_2k -lib COREAHBLITE_LIB {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CoreAHBLite\5.2.100\rtl\vlog\core\coreahblite_masterstage.v}
read_verilog -mode verilog_2k -lib COREAHBLITE_LIB {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CoreAHBLite\5.2.100\rtl\vlog\core\coreahblite_matrix4x16.v}
read_verilog -mode verilog_2k -lib COREAHBLITE_LIB {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CoreAHBLite\5.2.100\rtl\vlog\core\coreahblite_slavearbiter.v}
read_verilog -mode verilog_2k -lib COREAHBLITE_LIB {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CoreAHBLite\5.2.100\rtl\vlog\core\coreahblite_slavestage.v}
read_verilog -mode verilog_2k -lib COREAHBTOAPB3_LIB {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREAHBTOAPB3\3.1.100\rtl\vlog\core\coreahbtoapb3.v}
read_verilog -mode verilog_2k -lib COREAHBTOAPB3_LIB {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREAHBTOAPB3\3.1.100\rtl\vlog\core\coreahbtoapb3_ahbtoapbsm.v}
read_verilog -mode verilog_2k -lib COREAHBTOAPB3_LIB {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREAHBTOAPB3\3.1.100\rtl\vlog\core\coreahbtoapb3_apbaddrdata.v}
read_verilog -mode verilog_2k -lib COREAHBTOAPB3_LIB {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREAHBTOAPB3\3.1.100\rtl\vlog\core\coreahbtoapb3_penablescheduler.v}
read_verilog -mode verilog_2k -lib COREAPB3_LIB {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CoreAPB3\4.1.100\rtl\vlog\core\coreapb3.v}
read_verilog -mode verilog_2k -lib COREAPB3_LIB {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CoreAPB3\4.1.100\rtl\vlog\core\coreapb3_iaddr_reg.v}
read_verilog -mode verilog_2k -lib COREAPB3_LIB {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CoreAPB3\4.1.100\rtl\vlog\core\coreapb3_muxptob3.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_AHBMasterCtrl.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_AXIOutReg.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_AXISlaveCtrl.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_RAM_syncWrAsyncRd.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_readByteCnt.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_synchronizer.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_WSTRBAddrOffset.v}
read_verilog -mode verilog_2k -lib COREAXITOAHBL {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREAXITOAHBL\3.0.101\rtl\vlog\core\CoreAXItoAHBL_WSTRBPopCntr.v}
read_verilog -mode verilog_2k {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CoreGPIO\3.1.101\rtl\vlog\core\coregpio.v}
read_verilog -mode verilog_2k -lib COREJTAGDEBUG_LIB {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREJTAGDEBUG\1.0.101\rtl\vlog\core\corejtagdebug.v}
read_verilog -mode verilog_2k -lib COREJTAGDEBUG_LIB {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\COREJTAGDEBUG\1.0.101\rtl\vlog\core\corejtagdebug_uj_jtag.v}
read_verilog -mode verilog_2k {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CORERISCV_AXI4\1.0.9\rtl\verilog\AsyncFifo.v}
read_verilog -mode verilog_2k {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CORERISCV_AXI4\1.0.9\rtl\verilog\CoreRISCV_AXI4.v}
read_verilog -mode verilog_2k {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CORERISCV_AXI4\1.0.9\rtl\verilog\DebugTransportModuleJtag.v}
read_verilog -mode verilog_2k {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CORERISCV_AXI4\1.0.9\rtl\verilog\Top.v}
read_verilog -mode verilog_2k -lib CORETIMER_LIB {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\Actel\DirectCore\CoreTimer\2.0.103\rtl\vlog\core\coretimer.v}
read_verilog -mode verilog_2k {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\User\GlueLogic\AXI_GLUE_LOGIC\1.0.7\vlog\AXI_glue_logic.v}
read_verilog -mode verilog_2k {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\DDR_MEMORY_CTRL\COREABC_0\rtl\vlog\core\acmtable.v}
 add_include_path  {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\DDR_MEMORY_CTRL\COREABC_0\rtl\vlog\core}
read_verilog -mode verilog_2k {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\DDR_MEMORY_CTRL\COREABC_0\rtl\vlog\core\coreabc.v}
 add_include_path  {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\DDR_MEMORY_CTRL\COREABC_0\rtl\vlog\core}
read_verilog -mode verilog_2k {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\DDR_MEMORY_CTRL\COREABC_0\rtl\vlog\core\debugblk.v}
 add_include_path  {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\DDR_MEMORY_CTRL\COREABC_0\rtl\vlog\core}
read_verilog -mode verilog_2k {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\DDR_MEMORY_CTRL\COREABC_0\rtl\vlog\core\instructions.v}
 add_include_path  {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\DDR_MEMORY_CTRL\COREABC_0\rtl\vlog\core}
read_verilog -mode verilog_2k {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\DDR_MEMORY_CTRL\COREABC_0\rtl\vlog\core\instructnvm_bb.v}
read_verilog -mode verilog_2k {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\DDR_MEMORY_CTRL\COREABC_0\rtl\vlog\core\instructram.v}
read_verilog -mode verilog_2k {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\DDR_MEMORY_CTRL\COREABC_0\rtl\vlog\core\iram512x9_rtl.v}
read_verilog -mode verilog_2k {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\DDR_MEMORY_CTRL\COREABC_0\rtl\vlog\core\ram128x8_rtl.v}
read_verilog -mode verilog_2k {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\DDR_MEMORY_CTRL\COREABC_0\rtl\vlog\core\ram256x16_rtl.v}
read_verilog -mode verilog_2k {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\DDR_MEMORY_CTRL\COREABC_0\rtl\vlog\core\ram256x8_rtl.v}
read_verilog -mode verilog_2k {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\DDR_MEMORY_CTRL\COREABC_0\rtl\vlog\core\ramblocks.v}
read_verilog -mode verilog_2k {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\DDR_MEMORY_CTRL\DDR_MEMORY_CTRL.v}
read_verilog -mode verilog_2k {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\DDR_MEMORY_CTRL\FDDRC_0\DDR_MEMORY_CTRL_FDDRC_0_RTG4FDDRC.v}
read_verilog -mode verilog_2k {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\PROC_SUBSYSTEM\CoreUARTapb_0\rtl\vlog\core\Clock_gen.v}
read_verilog -mode verilog_2k {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\PROC_SUBSYSTEM\CoreUARTapb_0\rtl\vlog\core\CoreUART.v}
read_verilog -mode verilog_2k {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\PROC_SUBSYSTEM\CoreUARTapb_0\rtl\vlog\core\CoreUARTapb.v}
read_verilog -mode verilog_2k {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\PROC_SUBSYSTEM\CoreUARTapb_0\rtl\vlog\core\fifo_256x8_rtg4.v}
read_verilog -mode verilog_2k {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\PROC_SUBSYSTEM\CoreUARTapb_0\rtl\vlog\core\Rx_async.v}
read_verilog -mode verilog_2k {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\PROC_SUBSYSTEM\CoreUARTapb_0\rtl\vlog\core\Tx_async.v}
read_verilog -mode verilog_2k {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\PROC_SUBSYSTEM\PROC_SUBSYSTEM.v}
read_verilog -mode verilog_2k {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\PROC_SUBSYSTEM\RTG4FCCC_0\PROC_SUBSYSTEM_RTG4FCCC_0_RTG4FCCC.v}
set_top_level {PROC_SUBSYSTEM}
read_sdc -component {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\component\work\PROC_SUBSYSTEM\RTG4FCCC_0\PROC_SUBSYSTEM_RTG4FCCC_0_RTG4FCCC.sdc}
derive_constraints
write_sdc {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\constraint\PROC_SUBSYSTEM_derived_constraints.sdc}
write_pdc {C:\proj\RISC-V\RTG4_DDR\SP2\RTG4_CoreRISCV_AXI4_BaseDesign\constraint\fp\PROC_SUBSYSTEM_derived_constraints.pdc}
